vlm/extension/DataProcessors/бит_ПечатьЗаявкаНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПечатьЗаявкаНаПеревозкуГруза</Name>
			<Comment>ЛТ 22</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

vlm/extension/Enums/ТипыИсполнителейЗаданийНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыИсполнителейЗаданийНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашаТранспортнаяСлужба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Enums/ВидыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЗаданиеНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Паспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПриобретениеУслугПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_КоличествоМестИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Оплата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПунктов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеВыполняет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсполнителейЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/DataProcessors/бит_ПечатьЗаявкаНаПеревозкуГруза/Ext/ManagerModule.bsl
// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "(бит) Заявка на перевозку груза") Тогда
		//МакетУПД = ПолучитьМакет("Макет");	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"(бит) Заявка на перевозку груза",
		НСтр("ru = '(бит) Заявка на перевозку груза'"),
		СформироватьПечатнуюФормуЗаявкаНаПеревозкуГруза(МассивОбъектов, ОбъектыПечати));
		
		ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("(бит) Заявка на перевозку груза"), "ИмяВРЕГ");
		Если ОписаниеПечатнойФормы <> Неопределено Тогда
			ОписаниеПечатнойФормы.ДоступенВыводНаДругихЯзыках = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура("ИмяФормы");
	
	//ЗаявкаНаВозвратТоваровОтКлиентаЛокализация.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры  

Функция СформироватьПечатнуюФормуЗаявкаНаПеревозкуГруза(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ЗаданиеНаПеревозку.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозку.Склад КАК Склад,
	|	ЗаданиеНаПеревозку.Операция КАК Операция,
	|	ЗаданиеНаПеревозку.Номер КАК Номер,
	|	ЗаданиеНаПеревозку.Дата КАК Дата,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС КАК ДатаВремяРейсаПланС,
	|	ЗаданиеНаПеревозку.АвтомобильМарка КАК АвтомобильМарка,
	|	ЗаданиеНаПеревозку.АвтомобильГосударственныйНомер КАК АвтомобильГосударственныйНомер,
	|	ЗаданиеНаПеревозку.ГосударственныйНомерПрицепа КАК ГосударственныйНомерПрицепа,
	|	ЗаданиеНаПеревозку.Перевозчик КАК Перевозчик,
	|	ЗаданиеНаПеревозку.бит_Паспорт КАК бит_Паспорт,
	|	ЗаданиеНаПеревозку.бит_Телефон КАК бит_Телефон,
	|	ЗаданиеНаПеревозку.Склад.ТекущийОтветственный КАК СкладТекущийОтветственный,
	|	ЗаданиеНаПеревозку.бит_СуммаОплаты КАК бит_СуммаОплаты,
	|	ЗаданиеНаПеревозку.ВодительФИО КАК ВодительФИО,
	|	ЗаданиеНаПеревозку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ЗаданиеНаПеревозку.Контрагент КАК Контрагент,
	|	ЗаданиеНаПеревозку.ЗаданиеВыполняет КАК ЗаданиеВыполняет,
	|	ЗаданиеНаПеревозку.бит_Договор КАК бит_Договор
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка В(&МассивОбъектов)";
	
	ЗаполнитьТабличныйДокументЗаказаПоставщику(ТабличныйДокумент, Запрос, ОбъектыПечати);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументЗаказаПоставщику(ТабличныйДокумент, Запрос, ОбъектыПечати)
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаПеревозку_ЗоаявкаНаПеревозкуГруза";
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьДокумент = Макет.ПолучитьОбласть("Документ");
	
	Организация = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ОрганизацияПоУмолчанию,,Истина);
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если ДанныеПечати.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Заявка на перевозку не может быть сформирована для документа %1 от %2 
										|т.к. перевозка осуществляется своими силами (ЛТ 22)",
										ДанныеПечати.Номер, ДанныеПечати.Дата);
			Сообщение.Сообщить();
			
			Продолжить;
		КонецЕсли;		
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Вывод шапки документа
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("НомерДокумента", ДанныеПечати.Номер);
		СтруктураДанных.Вставить("ДатаДокумента", Формат(ДанныеПечати.Дата, "ДФ=dd.MM.yyyy"));
		СтруктураДанных.Вставить("ДатаЗагрузки", Формат(ДанныеПечати.ДатаВремяРейсаПланС, "ДФ=dd.MM.yyyy"));
		СтруктураДанных.Вставить("СуммаОплаты", ДанныеПечати.бит_СуммаОплаты);
		
		СтруктураДанных.Вставить("Водитель", ДанныеПечати.ВодительФИО); 
		СтруктураДанных.Вставить("Паспорт", ДанныеПечати.бит_Паспорт);  
		СтруктураДанных.Вставить("ТелефонВодителя", ДанныеПечати.бит_Телефон);
		СтруктураДанных.Вставить("Марка", ДанныеПечати.АвтомобильМарка);     
		СтруктураДанных.Вставить("ГосНомер", ДанныеПечати.АвтомобильГосударственныйНомер);
		СтруктураДанных.Вставить("НомерПрицепа", ДанныеПечати.ГосударственныйНомерПрицепа);
		СтруктураДанных.Вставить("ДополнительнаяИнформация", ДанныеПечати.ДополнительнаяИнформация);
		
		ДополнительныеСведениЗаказчика = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ДанныеПечати.Дата);
		СтруктураДанных.Вставить("Заказчик", ДополнительныеСведениЗаказчика.Представление);
		СтруктураДанных.Вставить("ЗаказчикИНН", ДополнительныеСведениЗаказчика.ИНН);
		СтруктураДанных.Вставить("ЗаказчикКПП", ДополнительныеСведениЗаказчика.КПП);
		СтруктураДанных.Вставить("ЗаказчикАдрес", ДополнительныеСведениЗаказчика.ЮридическийАдрес);
		СтруктураДанных.Вставить("ЗаказчикТелефон", ДополнительныеСведениЗаказчика.Телефоны); 	
		СтруктураДанных.Вставить("ЗаказчикЭлПочта", ДополнительныеСведениЗаказчика.АдресЭлектроннойПочты);											
		
		ДополнительныеСведениИсполнителя = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
		СтруктураДанных.Вставить("Исполнитель", ДополнительныеСведениИсполнителя.Представление);		
		СтруктураДанных.Вставить("ИсполнительИНН", ДополнительныеСведениИсполнителя.ИНН);
		СтруктураДанных.Вставить("ИсполнительПП", ДополнительныеСведениИсполнителя.КПП);
		СтруктураДанных.Вставить("ИсполнительАдрес", ДополнительныеСведениИсполнителя.ЮридическийАдрес);
		СтруктураДанных.Вставить("ИсполнительТелефон", ДополнительныеСведениИсполнителя.Телефоны); 	
		СтруктураДанных.Вставить("ИсполнительЭлПочта", ДополнительныеСведениИсполнителя.АдресЭлектроннойПочты);			

		Логист = Пользователи.ТекущийПользователь();
		ДанныеПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Логист,
										Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, ДанныеПечати.Дата, Истина);			
		СтруктураДанных.Вставить("Логист", Логист);			
		СтруктураДанных.Вставить("ЛогистТелефон", ДанныеПользователя);			

		//Вывод многострочных элементов
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуМаршрут.Адрес КАК АдресОтправления,
		|	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель КАК ПолучательОтправитель,
		|	ВЫРАЗИТЬ(ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Документ.ПоручениеЭкспедитору) КАК Распоряжение,
		|	ЗаданиеНаПеревозкуМаршрут.НомерСтроки КАК НомерСтроки,
		|	ЗаданиеНаПеревозкуМаршрут.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ЗаданиеНаПеревозкуМаршрут.ВремяС КАК ВремяС,
		|	ЗаданиеНаПеревозкуМаршрут.Вес КАК Вес
		|ПОМЕСТИТЬ ВТ_ПорученияЭкспедитору
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|		ПО ЗаданиеНаПеревозкуМаршрут.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Ссылка
		|			И ЗаданиеНаПеревозкуМаршрут.КлючСвязи = ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи
		|ГДЕ
		|	ЗаданиеНаПеревозкуМаршрут.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(ЗаданиеНаПеревозкуРаспоряжения.Распоряжение) = ТИП(Документ.ПоручениеЭкспедитору)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПорученияЭкспедитору.АдресОтправления КАК АдресОтправления,
		|	ВТ_ПорученияЭкспедитору.ПолучательОтправитель КАК ПолучательОтправитель,
		|	ВТ_ПорученияЭкспедитору.НомерСтроки КАК НомерСтроки,
		|	ВТ_ПорученияЭкспедитору.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ВТ_ПорученияЭкспедитору.Распоряжение.Пункт КАК РаспоряжениеПункт,
		|	ВТ_ПорученияЭкспедитору.Распоряжение.АдресДоставки КАК РаспоряжениеАдресДоставки,
		|	ВТ_ПорученияЭкспедитору.Распоряжение.ОсобыеУсловияПеревозкиОписание КАК РаспоряжениеОсобыеУсловияПеревозкиОписание,
		|	ВТ_ПорученияЭкспедитору.ВремяС КАК ДатаПрибытия,
		|	ВТ_ПорученияЭкспедитору.Распоряжение.КонтактноеЛицо КАК РаспоряжениеКонтактноеЛицо,
		|	ВТ_ПорученияЭкспедитору.Вес КАК Вес,
		|	ВТ_ПорученияЭкспедитору.Распоряжение.Ответственный.ФизическоеЛицо КАК РаспоряжениеОтветственныйФизическоеЛицо
		|ИЗ
		|	ВТ_ПорученияЭкспедитору КАК ВТ_ПорученияЭкспедитору
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеПечати.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеТЧМаршрут = РезультатЗапроса.Выбрать();		
		
		ДанныеАдресаСклада = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеПечати.Склад,
		Справочники.ВидыКонтактнойИнформации.АдресСклада, ДанныеПечати.Дата, Ложь);		
		
		ГородСклада = "";
		АдресСклада = "";
		Если ДанныеАдресаСклада.Количество()	> 0 Тогда
			ГородСклада = РаботаСАдресами.ГородАдресаКонтактнойИнформации(ДанныеАдресаСклада[0].Значение);  
			АдресСклада = ДанныеАдресаСклада[0].Представление;
		КонецЕсли;	 
		
		ФирмаЗагрузки = "";
        ПодробныйАдрес = ""; 
		ОтветственныйЗаПогрузку = "";
		ТелефонКонтактногоЛица = "";
		ВесИтог = 0; 
		ДополнительнаяИнформация = ""; 
		АдресМестаРазгрузки = "";  
		ФирмаВыгрузки = "";  
		ОсобыеУсловия = "";
		ОтветственныйЗаРазгрузку = "";  
		ТелефонМОЛ = "";    
		ДатаПрибытия = "";  
		ДанныеТелефонаМОЛ = "";
		ДанныеРабочегоТелефонаКонтактногоЛица = "";
		ДанныеМобильногоТелефонаКонтактногоЛица = "";
		
		Если ДанныеПечати.Операция = Перечисления.ВидыДоставки.НаСклад Тогда
	
			// Вывод строк таблицы "На наш Склад"
			АдресОтправления = ""; 	
			Пока ДанныеТЧМаршрут.Следующий() Цикл
				
				ПромежуточныйАдрес = ДанныеТЧМаршрут.АдресОтправления;	
				ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПромежуточныйАдрес,	Перечисления.ТипыКонтактнойИнформации.Адрес);
				ДанныеПромежуточногоАдреса = РаботаСАдресами.СведенияОбАдресе(ЗначенияПолей);
				ПромежуточныйГород = ДанныеПромежуточногоАдреса.Город;
				АдресОтправления = АдресОтправления + ПромежуточныйГород + " - ";
				
				ФирмаЗагрузки = ФирмаЗагрузки + ДанныеТЧМаршрут.РаспоряжениеПункт + Символы.ПС;
				
				ПодробныйАдрес = ПодробныйАдрес + ДанныеТЧМаршрут.РаспоряжениеАдресДоставки + Символы.ПС;
				
				ОтветственныйЗаПогрузку = ОтветственныйЗаПогрузку + ДанныеТЧМаршрут.РаспоряжениеКонтактноеЛицо + Символы.ПС;
				
				МОЛ = ДанныеТЧМаршрут.РаспоряжениеОтветственныйФизическоеЛицо;
				Если ЗначениеЗаполнено(МОЛ) Тогда
					ДанныеТелефонаМОЛ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(МОЛ,
					Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, ДанныеПечати.Дата, Истина);				
				КонецЕсли;
				ТелефонМОЛ = ДанныеТелефонаМОЛ;
				ОтветственныйЗаРазгрузку = ОтветственныйЗаРазгрузку + ДанныеТЧМаршрут.РаспоряжениеОтветственныйФизическоеЛицо +
				ТелефонМОЛ + Символы.ПС;
				
				ВесИтог = ВесИтог + ДанныеТЧМаршрут.Вес;
				
				ДополнительнаяИнформация = ДополнительнаяИнформация + ДанныеТЧМаршрут.ДополнительнаяИнформация + Символы.ПС;
				
				АдресМестаРазгрузки = АдресСклада;    
				
				ОсобыеУсловия = ОсобыеУсловия + ДанныеТЧМаршрут.РаспоряжениеОсобыеУсловияПеревозкиОписание + Символы.ПС;   

				ДатаПрибытия = ДатаПрибытия + Формат(ДанныеТЧМаршрут.ДатаПрибытия, "ДФ=dd.MM.yyyy") + Символы.ПС;  
				
			КонецЦикла;
			
			АдресОтправления = АдресОтправления + ГородСклада; 
 			ПодробныйАдрес = Лев(ПодробныйАдрес, СтрДлина(ПодробныйАдрес) - 1);
			ФирмаЗагрузки = Лев(ФирмаЗагрузки, СтрДлина(ФирмаЗагрузки) - 1);
 			ОтветственныйЗаПогрузку = Лев(ОтветственныйЗаПогрузку, СтрДлина(ОтветственныйЗаПогрузку) - 1); 
			ОтветственныйЗаРазгрузку = Лев(ОтветственныйЗаРазгрузку, СтрДлина(ОтветственныйЗаРазгрузку) - 1);

 			ДополнительнаяИнформация = Лев(ДополнительнаяИнформация, СтрДлина(ДополнительнаяИнформация) - 1);
            ФирмаВыгрузки = Справочники.Организации.ПолучитьРеквизитыОрганизации(Организация).НаименованиеПолное;
          	ОсобыеУсловия = Лев(ОсобыеУсловия, СтрДлина(ОсобыеУсловия) - 1);
            ДатаПрибытия = Лев(ДатаПрибытия, СтрДлина(ДатаПрибытия) - 1);  
			
		Иначе			
			
			// Вывод строк таблицы "С нашего Склада"
			АдресОтправления = ГородСклада;
			Пока ДанныеТЧМаршрут.Следующий() Цикл
				
				ПромежуточныйАдрес = ДанныеТЧМаршрут.АдресОтправления;
				ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПромежуточныйАдрес,	Перечисления.ТипыКонтактнойИнформации.Адрес);
				ДанныеПромежуточногоАдреса = РаботаСАдресами.СведенияОбАдресе(ЗначенияПолей);
				ПромежуточныйГород = ДанныеПромежуточногоАдреса.Город;
				АдресОтправления = АдресОтправления + " - " + ПромежуточныйГород;
				
				ВесИтог = ВесИтог + ДанныеТЧМаршрут.Вес;  

				ДополнительнаяИнформация = ДополнительнаяИнформация + ДанныеТЧМаршрут.ДополнительнаяИнформация + Символы.ПС;

				АдресМестаРазгрузки = АдресМестаРазгрузки + ДанныеТЧМаршрут.РаспоряжениеАдресДоставки + Символы.ПС;

				ФирмаВыгрузки = ФирмаВыгрузки + ДанныеТЧМаршрут.РаспоряжениеПункт + Символы.ПС;

				ОсобыеУсловия = ОсобыеУсловия + ДанныеТЧМаршрут.РаспоряжениеОсобыеУсловияПеревозкиОписание + Символы.ПС;
				
				КонтактноеЛицоРазгрузка = ДанныеТЧМаршрут.РаспоряжениеКонтактноеЛицо;
				Если ЗначениеЗаполнено(КонтактноеЛицоРазгрузка) Тогда
					ДанныеРабочегоТелефонаКонтактногоЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицоРазгрузка,
						Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица, ДанныеПечати.Дата, Истина);	
					ДанныеМобильногоТелефонаКонтактногоЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицоРазгрузка,
						Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица, ДанныеПечати.Дата, Истина);	
				КонецЕсли;
				РабочийТелефонКонтактногоЛица = ДанныеРабочегоТелефонаКонтактногоЛица;				
				МобильныйТелефонКонтактногоЛица = ДанныеМобильногоТелефонаКонтактногоЛица;
				ОтветственныйЗаРазгрузку = СтрШаблон("%1%2 
											| Раб. тел:%3
											| Моб. тел:%4%5",
									ОтветственныйЗаРазгрузку, ДанныеТЧМаршрут.РаспоряжениеКонтактноеЛицо,
									РабочийТелефонКонтактногоЛица, МобильныйТелефонКонтактногоЛица, Символы.ПС);
				
				МОЛ = ДанныеТЧМаршрут.РаспоряжениеОтветственныйФизическоеЛицо;
				Если ЗначениеЗаполнено(МОЛ) Тогда
					ДанныеТелефонаМОЛ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(МОЛ,
					Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, ДанныеПечати.Дата, Истина);				
				КонецЕсли;
				ТелефонМОЛ = ДанныеТелефонаМОЛ;
				ОтветственныйЗаПогрузку = ОтветственныйЗаПогрузку + ДанныеТЧМаршрут.РаспоряжениеОтветственныйФизическоеЛицо +
				ТелефонМОЛ + Символы.ПС;
				
				ДатаПрибытия = ДатаПрибытия + Формат(ДанныеТЧМаршрут.ДатаПрибытия, "ДФ=dd.MM.yyyy") + Символы.ПС;  
				
			КонецЦикла;	
			
			ФирмаЗагрузки = Справочники.Организации.ПолучитьРеквизитыОрганизации(Организация).НаименованиеПолное;
			ПодробныйАдрес = АдресСклада; 
 			ДополнительнаяИнформация = Лев(ДополнительнаяИнформация, СтрДлина(ДополнительнаяИнформация) - 1);
          	ФирмаВыгрузки = Лев(ФирмаВыгрузки, СтрДлина(ФирмаВыгрузки) - 1);
          	ОсобыеУсловия = Лев(ОсобыеУсловия, СтрДлина(ОсобыеУсловия) - 1);
 			ОтветственныйЗаРазгрузку = Лев(ОтветственныйЗаРазгрузку, СтрДлина(ОтветственныйЗаРазгрузку) - 1);
			ОтветственныйЗаПогрузку = Лев(ОтветственныйЗаПогрузку, СтрДлина(ОтветственныйЗаПогрузку) - 1);
            ДатаПрибытия = Лев(ДатаПрибытия, СтрДлина(ДатаПрибытия) - 1);
			
		КонецЕсли;
		
		НаименованиеГруза = ПолучитьНаименованиеГруза(ДанныеПечати.Ссылка);

		ОбластьДокумент.Параметры.Маршрут = ВРег(АдресОтправления);
		ОбластьДокумент.Параметры.ФирмаЗагрузки = ВРег(ФирмаЗагрузки);
	    ОбластьДокумент.Параметры.АдресПогрузки = ПодробныйАдрес;
		ОбластьДокумент.Параметры.КонтактноеЛицо = ОтветственныйЗаПогрузку;

		ОбластьДокумент.Параметры.Груз = НаименованиеГруза;
		ОбластьДокумент.Параметры.ВесГруза = ВесИтог;	            
		ОбластьДокумент.Параметры.ПриспособленияГруза = ДополнительнаяИнформация;
		ОбластьДокумент.Параметры.АдресРазгрузки = АдресМестаРазгрузки;
		ОбластьДокумент.Параметры.ФирмаНаВыгрузке = ФирмаВыгрузки;
		ОбластьДокумент.Параметры.ОсобыеУсловия = ОсобыеУсловия;

		ОбластьДокумент.Параметры.ОтветственныйЗаРазгрузку = ОтветственныйЗаРазгрузку;
        ОбластьДокумент.Параметры.ДатаПрибытияНаРазгрузку = ДатаПрибытия;
		// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 19:24:04] +        
		Если ДанныеПечати.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик И ЗначениеЗаполнено(ДанныеПечати.бит_Договор) Тогда
			ДополнительнаяИнформация1 = СтрШаблон("Данная заявка является неотъемлемой частью договора '%1 №%2 от %3'. Подписанная и переданная по электронной почте имеет юридическую силу.", ДанныеПечати.бит_Договор.НаименованиеДляПечати, СокрЛП(ДанныеПечати.бит_Договор.Номер), Формат(ДанныеПечати.бит_Договор.Дата, "ДФ=dd.MM.yyyy"));
		Иначе                                       
			ДополнительнаяИнформация1 = "";
		КонецЕсли;
		ОбластьДокумент.Параметры.ДополнительнаяИнформация1 = ДополнительнаяИнформация1;
		// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 19:24:04] -
				
		ОбластьДокумент.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(ОбластьДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
		ТабличныйДокумент,
		НомерСтрокиНачало,
		ОбъектыПечати,
		ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьНаименованиеГруза(СсылкаНаОбъект)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.ДополнительныеРеквизиты КАК ЗаданиеНаПеревозкуДополнительныеРеквизиты
		|ГДЕ
		|	ЗаданиеНаПеревозкуДополнительныеРеквизиты.Ссылка = &Ссылка
		|	И ЗаданиеНаПеревозкуДополнительныеРеквизиты.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Наименование груза"));
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаименованиеГруза = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаименованиеГруза = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Возврат НаименованиеГруза; 
	
КонецФункции
